"""
Дано натуральное число n , (n>9). Напишите программу, которая определяет его вторую (с начала) цифру.
"""

n = [int(i) for i in input()]
print(n[1])