# Напишите программу, которая найдет сумму кубов натуральных чисел от 50 до 100 включительно

print(sum(n**3 for n in range(50,101)))

