# На вход программе подается строка текста.
# Напишите программу, которая определяет количество различных символов в строке.

#line = set(input())
print(len(set(input())))